{
    "title":"how to learn JavaScript",
    "content":"The Internet is, above all else, a repository of knowledge. Whether you’re interested in self-guided learning or just don’t have the time to enroll in a formal program, flexible online courses might be the educational answer for you. These free and paid online courses show you how to learn JavaScript fast, but do keep in mind that “free” doesn’t always equate to “better.” Often, free programs will have less direction and offer less support than their paid alternatives. Be sure to do your research before you take your first class! Introduction to JavaScript Offered by: FreeCodeCamp Free This course is intended for aspiring programmers who have little to no prior knowledge of JavaScript. Its classes conduct deep dives into web scripting, data types, and JavaScript objects and loops. This course also offers a coding test after each unit to provide students with a means to demonstrate and reinforce their technical knowledge. Intro to JS: Drawing & Animation Offered by: Khan Academy Free As the name suggests, this no-cost course teaches students how to create illustrations and animations through simple JavaScript code. It structures its lessons via a host of videos, written guides, and exercises. JavaScript Guide Offered by: Mozilla Development Network (MDN) Free While it’s not a course per se, MDN’s JavaScript Guide provides comprehensive written tutorials that can walk developers of all experience levels through JavaScript’s capabilities. These guides are organized into four broad sections that target amateurs, beginners, intermediate programmers, and experts, respectively. Modern JavaScript From the Beginning Offered by: Udemy Paid This paid program provides JavaScript beginners with over 20 hours of on-demand video content and a library of downloadable resources. Students can progress at their own pace and access course material via their computers, mobile devices, or television. Introduction to JavaScript Offered by: Codecademy Paid This paid program provides an in-depth overview of the foundational elements of JavaScript, including data types and functions, objects, and control flows and loops. It also offers post-lesson quizzes and practical exercises to reinforce knowledge gained during the course.",
    "author":"satyadev",
    "slug":"how-to-learn-javascript"

}